Terraform Plan Output:
```
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/lambda/hello-kitty-function-prasad-naidu]
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=hello-kitty-role-prasad-naidu]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=ca603777-1108-4795-aa9a-8466418a35d7]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_bfba8659-303b-4924-a748-5e4a8bd58a5f.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-prasad-naidu:Writer]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this: Refreshing state... [id=hello-kitty-function-prasad-naidu]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0]: Refreshing state... [id=hello-kitty-function-prasad-naidu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this must be replaced
-/+ resource "aws_lambda_function" "this" {
      ~ arn                            = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-prasad-naidu" -> (known after apply)
      ~ code_sha256                    = "ThpXeTZobED3ATPn7m4pXZIgyOEqiZM/qo5OX/My6zE=" -> (known after apply)
      ~ function_name                  = "hello-kitty-function-prasad-naidu" -> "hello-kitty-function-prasad_naidu_661992" # forces replacement
      ~ id                             = "hello-kitty-function-prasad-naidu" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-prasad-naidu/invocations" -> (known after apply)
      ~ last_modified                  = "2024-09-28T10:00:58.099+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-prasad-naidu:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-prasad-naidu:$LATEST/invocations" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 2168 -> (known after apply)
        tags                           = {
            "appstack"  = "hello-kitty-raddison"
            "component" = "hello-kitty"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "IMAGES_BUCKET" = "prasad_naidu_8" -> "prasad_naidu_661992"
            }
        }

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/hello-kitty-function-prasad-naidu" -> null
            # (2 unchanged attributes hidden)
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0] must be replaced
-/+ resource "aws_lambda_function_url" "this" {
      ~ function_arn       = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-prasad-naidu" -> (known after apply)
      ~ function_name      = "hello-kitty-function-prasad-naidu" -> "hello-kitty-function-prasad_naidu_661992" # forces replacement
      ~ function_url       = "https://fe6pgp536huoiffgzjwba6st3u0tbwmk.lambda-url.us-west-2.on.aws/" -> (known after apply)
      ~ id                 = "hello-kitty-function-prasad-naidu" -> (known after apply)
      ~ url_id             = "fe6pgp536huoiffgzjwba6st3u0tbwmk" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0] will be created
  + resource "aws_kms_alias" "a" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3-prasad_naidu_661992"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "ca603777-1108-4795-aa9a-8466418a35d7"
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "prasad_naidu_661992"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "appstack"  = "hello-kitty-raddison"
          + "component" = "hello-kitty"
        }
      + tags_all                    = {
          + "appstack"  = "hello-kitty-raddison"
          + "component" = "hello-kitty"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "ca603777-1108-4795-aa9a-8466418a35d7"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.appcd_a4d4c413-57e8-4ed8-8ee6-e212b32246cb.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "aws_s3-hello-kitty-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "hello-kitty-role-prasad-naidu"
    }

Plan: 8 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + aws_lambda_hello_kitty_function_prasad_naidu_661992_function_arn           = (known after apply)
  + aws_lambda_hello_kitty_function_prasad_naidu_661992_function_name          = "hello-kitty-function-prasad_naidu_661992"
  + aws_lambda_hello_kitty_function_prasad_naidu_661992_function_url           = (known after apply)
  + aws_lambda_hello_kitty_function_prasad_naidu_661992_invoke_arn             = (known after apply)
  - aws_lambda_hello_kitty_function_prasad_naidu_function_arn                  = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-prasad-naidu" -> null
  - aws_lambda_hello_kitty_function_prasad_naidu_function_name                 = "hello-kitty-function-prasad-naidu" -> null
  - aws_lambda_hello_kitty_function_prasad_naidu_function_url                  = "https://fe6pgp536huoiffgzjwba6st3u0tbwmk.lambda-url.us-west-2.on.aws/" -> null
  - aws_lambda_hello_kitty_function_prasad_naidu_invoke_arn                    = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-prasad-naidu/invocations" -> null
  + aws_s3_prasad_naidu_661992_arn                                             = (known after apply)
  + aws_s3_prasad_naidu_661992_bucket_name                                     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```